import React, { useState, useEffect, useRef } from "react";
import Slider from "react-slick";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import "./doctor.css"
import { BiCheck } from "react-icons/bi";

const Doctor = () => {
  const [currentSlide, setCurrentSlide] = useState(0);
  const sliderRef = useRef(null);

  // Настройки слайдера
  const sliderSettings = {
    dots: false,
    infinite: false,
    speed: 1300,
    slidesToShow: 1,
    slidesToScroll: 1,
    beforeChange: (oldIndex, newIndex) => setCurrentSlide(newIndex),
  };

  //   useEffect(() => {
  //     // Автоматическое переключение слайдов каждые 3 секунды
  //     const interval = setInterval(() => {
  //       sliderRef.current.slickNext(); // Переходим к следующему слайду
  //     }, 3000);

  //     return () => clearInterval(interval);
  //   }, []);

  const handleTitleClick = (index) => {
    setCurrentSlide(index);
    sliderRef.current.slickGoTo(index);
  };

  const handlePrevSlide = () => {
    sliderRef.current.slickPrev();
  };

  const handleNextSlide = () => {
    sliderRef.current.slickNext();
  };

  const slidesContent = [
    {
        num:1,
      title: "Что надо знать, выбирая  клинику?",
      name: "Детальная диагностика и планирование",
      description: "Вам не должны предлагать установку имплантов в день посещения и только на основании панорамного снимка или визуального осмотра. Важна тщательная диагностика, а также проведение компьютерной томографии, сдача анализов крови.",
      description2: "Наша стоматология работает по международным стандартам комплексной диагностики: сбор анамнеза, комплексные анализы, визуальный осмотр полости рта, анализ компьютерной томографии, фотометрия лица пациента и снятие параметров прикуса. Только после этого имплантолог и ортопед могут составить предварительные планы лечения, которые впоследствии нужно будет уточнить в процессе компьютерного моделирования и дополнительной диагностики по назначению",
    },
    {
        num:2,
      title: "Что надо знать, выбирая клинику?",
      name: "Детальная диагностика и планирование",
      description: "Вам не должны предлагать установку имплантов в день посещения и только на основании панорамного снимка или визуального осмотра. Важна тщательная диагностика, а также проведение компьютерной томографии, сдача анализов крови.",
      description2: "Наша стоматология работает по международным стандартам комплексной диагностики: сбор анамнеза, комплексные анализы, визуальный осмотр полости рта, анализ компьютерной томографии, фотометрия лица пациента и снятие параметров прикуса. Только после этого имплантолог и ортопед могут составить предварительные планы лечения, которые впоследствии нужно будет уточнить в процессе компьютерного моделирования и дополнительной диагностики по назначению",
    },
    {
        num:3,
      title: "Что надо знать, выбирая клинику?",
      name: "Детальная диагностика и планирование",
      description: "Вам не должны предлагать установку имплантов в день посещения и только на основании панорамного снимка или визуального осмотра. Важна тщательная диагностика, а также проведение компьютерной томографии, сдача анализов крови.",
      description2: "Наша стоматология работает по международным стандартам комплексной диагностики: сбор анамнеза, комплексные анализы, визуальный осмотр полости рта, анализ компьютерной томографии, фотометрия лица пациента и снятие параметров прикуса. Только после этого имплантолог и ортопед могут составить предварительные планы лечения, которые впоследствии нужно будет уточнить в процессе компьютерного моделирования и дополнительной диагностики по назначению",
    },
    {
        num:4,
      title: "Что надо знать, выбирая клинику?",
      name: "Детальная диагностика и планирование",
      description: "Вам не должны предлагать установку имплантов в день посещения и только на основании панорамного снимка или визуального осмотра. Важна тщательная диагностика, а также проведение компьютерной томографии, сдача анализов крови.",
      description2: "Наша стоматология работает по международным стандартам комплексной диагностики: сбор анамнеза, комплексные анализы, визуальный осмотр полости рта, анализ компьютерной томографии, фотометрия лица пациента и снятие параметров прикуса. Только после этого имплантолог и ортопед могут составить предварительные планы лечения, которые впоследствии нужно будет уточнить в процессе компьютерного моделирования и дополнительной диагностики по назначению",
    },
  ];

  return (
    <div className="container">
      <div className="relative my-11">
        {/* Слайдер */}
        <Slider {...sliderSettings} ref={sliderRef}>
          {slidesContent.map((content, index) => (
            <div
              className="w-full h-[656px] bg-[#F2FAFB] flex items-center justify justify-between px-4"
              key={index}
            >
              <div className="flex items-center justify-between px-[60px]">
                <div className="w-[510px]">
                  <h1 className="text-3xl text-black font-bold pt-14">
                    {content.title}
                  </h1>





<div className="flex items-center justify-between gap-11">

        <div
          className="flex gap-2 "
          style={{ 
        
            
            textAlign: "center", marginTop: "20px" }}
        >
          {slidesContent.map((content, index) => (
            <span
              className="hover:border-b-2 border-[#2CB2BB] text-[#2CB2BB]"
              key={index}
              onClick={() => handleTitleClick(index)}
              style={{
                cursor: "pointer",
                marginRight: "10px",
                fontWeight: currentSlide === index ? "bold" : "normal",
                color: currentSlide === index ? "black" : "#2CB2BB",
              }}
            >
             <button style={{
                fontWeight:"700",
                color:
                currentSlide === index ? "white" : "#2CB2BB",
                  background:
                  currentSlide === index ? "#2CB2BB" : "white",
             }} class="btn text-[#2CB2BB]"> {content.num}
</button>
            </span>
          ))}
        </div>
<div className="">

<button
onClick={handleNextSlide}
 className="relative pt-5 inline-flex items-center text-lg justify-center w-[202px] from-cyan-500  group-hover:from-cyan-500 group-hover:to-[#2CB2BB] hover:text-[#2CB2BB] dark:text-[#2CB2BB] hover:scale-110 duration-200 my-7">
                    <span className="relative font-bold px-5 text-sm py-[13px] transition-all ease-in duration-75 bg-[#2CB2BB] text-white dark:bg-gray-900 rounded-md group-hover:bg-opacity-0">
                    Следующий шаг
                    </span>
                  </button>
          </div>

          </div>





                  <h1 className="text-lg my-4 text-black font-bold">
                    {content.name}
                  </h1>
                  <div className="flex items-start gap-3">
                    <span className="mt-3 text-[#2CB2BB]">
                  <BiCheck />
                    </span>
                      

                  <h1 className="tt font-normal my-3 text-black">
                    {content.description}
                  </h1>
                  </div>
                
                <div className="flex items-start gap-3">
                  <span className="mt-3 text-[#2CB2BB]">
                <BiCheck />
                  </span>

                  <h1 className="tt font-normal my-3 text-black">
                    {content.description2}
                  </h1>
                </div>
              
                </div>
                <img
                  className="w-[386px] h-[612px] mb-[-100px]"
                  src="https://s3-alpha-sig.figma.com/img/c1a1/2765/8cca3b0bcec00a13f839629d8ce068fd?Expires=1710115200&Key-Pair-Id=APKAQ4GOSFWCVNEHN3O4&Signature=ZmPo6~aGj~-VngyQcvS39aCVlKXCfTW2oDwQBOfIw~bwsvtnzJCGrYepfpIuw3CRwPyLGcN7REedSXyem4usMZ~USGFv-Ytz61EIkSqPS8dTcugp2kPULjLU6vBKqlS6Ho3gsDWSMPjo4FnovdSs6dBibx9r2kk--8Zj3wM2utDAWhYG-qWnrYko-P5dw0zNKnAHBlodDXfoBA0V8AzIfACpIz0AjaPSBYKcuMS8mU4VSHcnh-6akku4m1wUUi9nRiHqlkeYrij3mFBBtkhY0vIcPNCB2mW4cWn1KfWs1awz3NVi08CGaBrLt0tfb9z93RwuCHHU1-IZn5M6kSYj-w__"
                  alt="img"
                />
              </div>
            </div>
          ))}
        </Slider>


        {/* <div
          className="flex gap-2 absolute right-5 bottom-16"
          style={{ textAlign: "center", marginTop: "20px" }}
        >
          <button onClick={handlePrevSlide}>
            <div class="btn-container bg-gray-400 rounded-full">
              <a href="#" class="btn-content">
                <span class="icon-arrow">
                  <svg
                    xmlnsXlink="http://www.w3.org/1999/xlink"
                    xmlns="http://www.w3.org/2000/svg"
                    version="1.1"
                    viewBox="0 0 66 43"
                    height="30px"
                    width="30px"
                  >
                    <g
                      fill-rule="evenodd"
                      fill="none"
                      stroke-width="1"
                      stroke="none"
                      id="arrow"
                    >
                      <path
                        fill="#9ee5fa"
                        d="M65.8456067,3.89485454 L62.0236851,0.139296592 C61.8291689,-0.0518420739 61.5173671,-0.0518571125 61.3228325,0.139262789 L40.3083866,20.7848311 C39.9144199,21.1718824 39.9088137,21.8050225 40.295865,22.1989893 C40.2999812,22.2031791 40.3041343,22.2073326 40.3083238,22.2114492 L61.322902,42.8607841 C61.5174043,43.0519059 61.8291758,43.0519358 62.0237147,42.8608513 L65.8454814,39.1069479 C66.0424848,38.9134427 66.0453207,38.5968729 65.8518155,38.3998695 C65.8497107,38.3977268 65.8475868,38.395603 65.8454438,38.3934985 L49.0062211,21.8567812 C48.8091972,21.6632968 48.806328,21.3467273 48.9998124,21.1497035 C49.0019353,21.1475418 49.0040777,21.1453995 49.0062395,21.1432767 L65.8454792,4.60825197 C66.0425131,4.41477773 66.0453987,4.09820839 65.8519244,3.90117456 C65.8498374,3.89904911 65.8477314,3.89694235 65.8456067,3.89485454 Z"
                        id="arrow-icon-one"
                      ></path>
                      <path
                        fill="#9ee5fa"
                        d="M45.8456067,3.89485454 L42.0236851,0.139296592 C41.8291689,-0.0518420739 41.5173671,-0.0518571125 41.3228325,0.139262789 L20.3083866,20.7848311 C19.9144199,21.1718824 19.9088137,21.8050225 20.295865,22.1989893 C20.2999812,22.2031791 20.3041343,22.2073326 20.3083238,22.2114492 L41.322902,42.8607841 C41.5174043,43.0519059 41.8291758,43.0519358 42.0237147,42.8608513 L45.8454814,39.1069479 C46.0424848,38.9134427 46.0453207,38.5968729 45.8518155,38.3998695 C45.8497107,38.3977268 45.8475868,38.395603 45.8454438,38.3934985 L29.0062211,21.8567812 C28.8091972,21.6632968 28.806328,21.3467273 28.9998124,21.1497035 C29.0019353,21.1475418 29.0040777,21.1453995 29.0062395,21.1432767 L45.8454792,4.60825197 C46.0425131,4.41477773 46.0453987,4.09820839 45.8519244,3.90117456 C45.8498374,3.89904911 45.8477314,3.89694235 45.8456067,3.89485454 Z"
                        id="arrow-icon-two"
                      ></path>
                      <path
                        fill="#9ee5fa"
                        d="M25.8456067,3.89485454 L22.0236851,0.139296592 C21.8291689,-0.0518420739 21.5173671,-0.0518571125 21.3228325,0.139262789 L0.308386597,20.7848311 C-0.0855799173,21.1718824 -0.0911863411,21.8050225 0.295864965,22.1989893 C0.299981192,22.2031791 0.304134276,22.2073326 0.308323781,22.2114492 L21.322902,42.8607841 C21.5174043,43.0519059 21.8291758,43.0519358 22.0237147,42.8608513 L25.8454814,39.1069479 C26.0424848,38.9134427 26.0453207,38.5968729 25.8518155,38.3998695 C25.8497107,38.3977268 25.8475868,38.395603 25.8454438,38.3934985 L9.00622113,21.8567812 C8.8091972,21.6632968 8.80632801,21.3467273 8.99981244,21.1497035 C9.00193534,21.1475418 9.00407775,21.1453995 9.00623955,21.1432767 L25.8454792,4.60825197 C26.0425131,4.41477773 26.0453987,4.09820839 25.8519244,3.90117456 C25.8498374,3.89904911 25.8477314,3.89694235 25.8456067,3.89485454 Z"
                        id="arrow-icon-three"
                      ></path>
                    </g>
                  </svg>
                </span>
              </a>
            </div>
          </button>

          <button onClick={handleNextSlide}>
            <div class="btn-conteiner">
              <a href="#" class="btn-content">
                <span class="icon-arrow">
                  <svg
                    xmlnsXlink="http://www.w3.org/1999/xlink"
                    xmlns="http://www.w3.org/2000/svg"
                    version="1.1"
                    viewBox="0 0 66 43"
                    height="30px"
                    width="30px"
                  >
                    <g
                      fill-rule="evenodd"
                      fill="none"
                      stroke-width="1"
                      stroke="none"
                      id="arrow"
                    >
                      <path
                        fill="#9ee5fa"
                        d="M40.1543933,3.89485454 L43.9763149,0.139296592 C44.1708311,-0.0518420739 44.4826329,-0.0518571125 44.6771675,0.139262789 L65.6916134,20.7848311 C66.0855801,21.1718824 66.0911863,21.8050225 65.704135,22.1989893 C65.7000188,22.2031791 65.6958657,22.2073326 65.6916762,22.2114492 L44.677098,42.8607841 C44.4825957,43.0519059 44.1708242,43.0519358 43.9762853,42.8608513 L40.1545186,39.1069479 C39.9575152,38.9134427 39.9546793,38.5968729 40.1481845,38.3998695 C40.1502893,38.3977268 40.1524132,38.395603 40.1545562,38.3934985 L56.9937789,21.8567812 C57.1908028,21.6632968 57.193672,21.3467273 57.0001876,21.1497035 C56.9980647,21.1475418 56.9959223,21.1453995 56.9937605,21.1432767 L40.1545208,4.60825197 C39.9574869,4.41477773 39.9546013,4.09820839 40.1480756,3.90117456 C40.1501626,3.89904911 40.1522686,3.89694235 40.1543933,3.89485454 Z"
                        id="arrow-icon-one"
                      ></path>
                      <path
                        fill="#9ee5fa"
                        d="M20.1543933,3.89485454 L23.9763149,0.139296592 C24.1708311,-0.0518420739 24.4826329,-0.0518571125 24.6771675,0.139262789 L45.6916134,20.7848311 C46.0855801,21.1718824 46.0911863,21.8050225 45.704135,22.1989893 C45.7000188,22.2031791 45.6958657,22.2073326 45.6916762,22.2114492 L24.677098,42.8607841 C24.4825957,43.0519059 24.1708242,43.0519358 23.9762853,42.8608513 L20.1545186,39.1069479 C19.9575152,38.9134427 19.9546793,38.5968729 20.1481845,38.3998695 C20.1502893,38.3977268 20.1524132,38.395603 20.1545562,38.3934985 L36.9937789,21.8567812 C37.1908028,21.6632968 37.193672,21.3467273 37.0001876,21.1497035 C36.9980647,21.1475418 36.9959223,21.1453995 36.9937605,21.1432767 L20.1545208,4.60825197 C19.9574869,4.41477773 19.9546013,4.09820839 20.1480756,3.90117456 C20.1501626,3.89904911 20.1522686,3.89694235 20.1543933,3.89485454 Z"
                        id="arrow-icon-two"
                      ></path>
                      <path
                        fill="#9ee5fa"
                        d="M0.154393339,3.89485454 L3.97631488,0.139296592 C4.17083111,-0.0518420739 4.48263286,-0.0518571125 4.67716753,0.139262789 L25.6916134,20.7848311 C26.0855801,21.1718824 26.0911863,21.8050225 25.704135,22.1989893 C25.7000188,22.2031791 25.6958657,22.2073326 25.6916762,22.2114492 L4.67709797,42.8607841 C4.48259567,43.0519059 4.17082418,43.0519358 3.97628526,42.8608513 L0.154518591,39.1069479 C-0.0424848215,38.9134427 -0.0453206733,38.5968729 0.148184538,38.3998695 C0.150289256,38.3977268 0.152413239,38.395603 0.154556228,38.3934985 L16.9937789,21.8567812 C17.1908028,21.6632968 17.193672,21.3467273 17.0001876,21.1497035 C16.9980647,21.1475418 16.9959223,21.1453995 16.9937605,21.1432767 L0.15452076,4.60825197 C-0.0425130651,4.41477773 -0.0453986756,4.09820839 0.148075568,3.90117456 C0.150162624,3.89904911 0.152268631,3.89694235 0.154393339,3.89485454 Z"
                        id="arrow-icon-three"
                      ></path>
                    </g>
                  </svg>
                </span>
              </a>
            </div>
          </button>
        </div> */}
      </div>
    </div>
  );
};

export default Doctor;

/////////////////////////////////////////AZIRET 1
